archives/2024/Results/Verifications/S2427/bottleneck-determination/update_index/threads-8/sysbench.log
time sysbench --config-file=sysbench.conf --threads=8 oltp_update_index --tables=32 --table-size=1000000 --db-ps-mode=auto --rand-typ
e=uniform run
sysbench 1.0.20 (using system LuaJIT 2.1.1700206165)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 1641.15 qps: 1641.15 (r/w/o: 0.00/1602.17/38.98) lat (ms,95%): 7.17 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 1622.26 qps: 1622.26 (r/w/o: 0.00/1580.86/41.40) lat (ms,95%): 8.74 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 1682.98 qps: 1682.98 (r/w/o: 0.00/1640.28/42.70) lat (ms,95%): 8.13 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 1663.47 qps: 1663.47 (r/w/o: 0.00/1620.77/42.70) lat (ms,95%): 8.13 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 1744.08 qps: 1744.08 (r/w/o: 0.00/1699.58/44.50) lat (ms,95%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 1777.49 qps: 1777.49 (r/w/o: 0.00/1732.59/44.90) lat (ms,95%): 7.30 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 8 tps: 1747.01 qps: 1747.01 (r/w/o: 0.00/1705.51/41.50) lat (ms,95%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 8 tps: 1910.20 qps: 1910.20 (r/w/o: 0.00/1865.80/44.40) lat (ms,95%): 6.67 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 8 tps: 1961.49 qps: 1961.49 (r/w/o: 0.00/1915.09/46.40) lat (ms,95%): 6.55 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 8 tps: 1966.56 qps: 1966.56 (r/w/o: 0.00/1918.76/47.80) lat (ms,95%): 6.55 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           172830
        other:                           4353
        total:                           177183
    transactions:                        177183 (1771.63 per sec.)
    queries:                             177183 (1771.63 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          100.0068s
    total number of events:              177183

Latency (ms):
         min:                                    1.22
         avg:                                    4.51
         max:                                  893.70
         95th percentile:                        7.43
         sum:                               799629.69

Threads fairness:
    events (avg/stddev):           22147.8750/35.49
    execution time (avg/stddev):   99.9537/0.00


real    1m40.102s
user    0m3.460s
sys     0m9.994s